Revit 2015 API
GutterTypeSet Properties
The GutterTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
Size
Returns the number of gutter types that are in the set.
See Also
GutterTypeSet Class
Autodesk.Revit.DB.Architecture Namespace